keybindings.org
# -*- mode: org; coding: utf-8; -*-
#+title: Psimacs Key Bindings
#+description: Overview of the Psimacs keyb indings.
#+tags: Emacs
#+categories: editing
# #+startup: showeverything
#+options: toc:4 h:4 tags:nil
#+export_exclude_tags: noexport
#+html_head: <style type="text/css">
#+html_head: .styledtable col:nth-of-type(1) { width: 20% }
#+html_head: .styledtable col:nth-of-type(2) { width: 50% }
#+html_head: .styledtable col:nth-of-type(3) { width: 30% }
#+html_head: </style>
#+html_head: <link rel="stylesheet" href="https://hatlafax.github.io/psimacs/css/psimacs.css" type="text/css" />
