keybindings.org
* Overview of Psimacs Key Bindings

The following tables summarizes the key bindings added explicitly by *Psimacs*. Neither shown are the bindings provided
by the various packages nor by *Emacs* itself.

| Prefix command  | Description               |
|-----------------+---------------------------|
| =H-SPC= =s-SPC=     | Hydras                    |
| =H-h= =s-h=         | Help                      |
| =H-c= =s-c=         | common user commands      |
| =H-x= =s-x=         | common execution commands |
| =H-m= =H-,= =s-m= =s-,= | special user commands     |
|-----------------+---------------------------|

#+attr_html: :class styledtable
| Key binding       | Command                                                               | Description                                                                                                                                                                                                                                                                                |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-TAB=             | =M-x psimacs/buffer/next-user-buffer=                                   | Switch to the next user buffer. Buffer name starts with *, it's not considered a user buffer.                                                                                                                                                                                              |
| =C-S-TAB=           | =M-x psimacs/buffer/previous-user-buffer=                               | Switch to the previous user buffer. Buffer name starts with *, it's not considered a user buffer.                                                                                                                                                                                          |
| =H-TAB=             | =M-x psimacs/buffer/next-emacs-buffer=                                  | Switch to the next emacs buffer, i.e. that starts with *.                                                                                                                                                                                                                                  |
| =H-S-TAB=           | =M-x psimacs/buffer/previous-emacs-buffer=                              | Switch to the previous emacs buffer, i.e. that starts with *.                                                                                                                                                                                                                              |
| =C-x <right>=       | =M-x next-buffer=                                                       | Switch to the next buffer.                                                                                                                                                                                                                                                                 |
| =C-x <left>=        | =M-x previous-buffer=                                                   | Switch to the previous buffer.                                                                                                                                                                                                                                                             |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =M-<f4>=            | =M-x psimacs/config/delete-frame=                                       | Delete current frame.                                                                                                                                                                                                                                                                      |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =<f2>=              | =M-x bm-next=                                                           | Jump to the next bookmark.                                                                                                                                                                                                                                                                 |
| =S-<f2>=            | =M-x bm-previous=                                                       | Jump to the previous bookmark.                                                                                                                                                                                                                                                             |
| =C-<f2>=            | =M-x bm-toggle=                                                         | Set or unset bookmark.                                                                                                                                                                                                                                                                     |
| =C-S-<f2>=          | =M-x bm-remove-all-current-buffer=                                      | Remove all bookmarks of the current buffer.                                                                                                                                                                                                                                                |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =<f8>=              | =M-x prettify-symbols-mode=                                             | Toggle =prettify-symbols-mode=.                                                                                                                                                                                                                                                              |
| =M-<f8>=            | =M-x global-prettify-symbols-mode=                                      | Toggle =prettify-symbols-mode= globally.                                                                                                                                                                                                                                                     |
| =C-<f8>=            | =M-x psimacs/dashboard/open-dashboard=                                  | Open the dashboard.                                                                                                                                                                                                                                                                        |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-TAB=             | =M-x company-try-hard=                                                  | Try hard to find a completion. If none of the current completions look good, call the command again to try the next backend.                                                                                                                                                               |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c <left>=        | =M-x winner-undo=                                                       | Switch back to an earlier window configuration saved by Winner mode.                                                                                                                                                                                                                       |
| =C-c <right>=       | =M-x winner-redo=                                                       | Restore a more recent window configuration saved by Winner mode.                                                                                                                                                                                                                           |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c / /=           | =M-x rxt-explain=                                                       | Pop up a buffer with pretty-printed `rx' syntax for the regex at point.                                                                                                                                                                                                                    |
| =C-c / c=           | =M-x rxt-convert-syntax=                                                | Convert regex at point to other kind of syntax, depending on major mode.                                                                                                                                                                                                                   |
| =C-c / x=           | =M-x rxt-convert-to-rx=                                                 | Convert regex at point to RX syntax. Chooses Emacs or PCRE syntax by major mode.                                                                                                                                                                                                           |
| =C-c / '=           | =M-x rxt-convert-to-strings=                                            | Convert regex at point to RX syntax. Chooses Emacs or PCRE syntax by major mode.                                                                                                                                                                                                           |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c / p e=         | =M-x rxt-pcre-to-elisp=                                                 | Translate PCRE, a regexp in Perl-compatible syntax, to Emacs Lisp.                                                                                                                                                                                                                         |
| =C-c / %=           | =M-x pcre-query-replace-regexp=                                         | Perform =query-replace-regexp= using PCRE syntax.                                                                                                                                                                                                                                            |
| =C-c / p x=         | =M-x rxt-pcre-to-rx=                                                    | Translate PCRE, a regexp in Perl-compatible syntax, to `rx' syntax.                                                                                                                                                                                                                        |
| =C-c / p '=         | =M-x rxt-pcre-to-strings=                                               | Return a list of all strings matched by PCRE, a Perl-compatible regexp.                                                                                                                                                                                                                    |
| =C-c / p /=         | =M-x rxt-explain-pcre=                                                  | Insert the pretty-printed `rx' syntax for REGEXP in a new buffer.                                                                                                                                                                                                                          |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c / e /=         | =M-x rxt-explain-elisp=                                                 | Insert the pretty-printed `rx' syntax for REGEXP in a new buffer.                                                                                                                                                                                                                          |
| =C-c / e p=         | =M-x rxt-elisp-to-pcre=                                                 | Translate REGEXP, a regexp in Emacs Lisp syntax, to Perl-compatible syntax.                                                                                                                                                                                                                |
| =C-c / e x=         | =M-x rxt-elisp-to-rx=                                                   | Translate REGEXP, a regexp in Emacs Lisp syntax, to `rx' syntax.                                                                                                                                                                                                                           |
| =C-c / e '=         | =M-x rxt-elisp-to-strings=                                              | Return a list of all strings matched by REGEXP, an Emacs Lisp regexp.                                                                                                                                                                                                                      |
| =C-c / e t=         | =M-x rxt-toggle-elisp-rx=                                               | Toggle the regexp near point between Elisp string and rx syntax.                                                                                                                                                                                                                           |
| =C-c / t=           | =M-x rxt-toggle-elisp-rx=                                               | Toggle the regexp near point between Elisp string and rx syntax.                                                                                                                                                                                                                           |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-r=               | =M-x swiper=                                                            | Incrementally search with an overview.                                                                                                                                                                                                                                                     |
| =C-c v=             | =M-x ivy-push-view=                                                     | Push the current window tree on =ivy-views=                                                                                                                                                                                                                                                  |
| =C-c V=             | =M-x ivy-pop-view=                                                      | Delete a view to delete from =ivy-views=.                                                                                                                                                                                                                                                    |
| =C-x b=             | =M-x ivy-switch-buffer=                                                 | Switch to another buffer.                                                                                                                                                                                                                                                                  |
| =C-c C-S-r=         | =M-x ivy-resume=                                                        | Resumes the last Ivy-based completion.                                                                                                                                                                                                                                                     |
| =M-y=               | =M-x ivy-next-line=                                                     | In minibuffer, Move cursor vertically down.                                                                                                                                                                                                                                                |
| =C-'=               | =M-x ivy-avy=                                                           | Uses avy to select one of the candidates on the current candidate page.                                                                                                                                                                                                                    |
| =H-w=               | =M-x ivy-avy=                                                           | Uses avy to select one of the candidates on the current candidate page.                                                                                                                                                                                                                    |
| =M-x=               | =M-x counsel-M-x=                                                       | Ivy version of =execute-extended-command=.                                                                                                                                                                                                                                                   |
| =C-M-i=             | =M-x counsel-imenu=                                                     | Jump to a buffer position indexed by =imenu=.                                                                                                                                                                                                                                                |
| =C-x C-f=           | =M-x counsel-find-file=                                                 | Counsel, forward to =find-file=.                                                                                                                                                                                                                                                             |
| =C-c b=             | =M-x counsel-bookmark=                                                  | Forward to =bookmark-jump= or =bookmark-set= if bookmark does not exist.                                                                                                                                                                                                                       |
| =C-c c=             | =M-x counsel-compile=                                                   | Call =compile= completing with smart suggestions, optionally for DIR.                                                                                                                                                                                                                        |
| =C-c d=             | =M-x counsel-dired-jump=                                                | Jump to a directory below the current directory.                                                                                                                                                                                                                                           |
| =C-c F=             | =M-x counsel-org-file=                                                  | Browse all attachments for current Org file.                                                                                                                                                                                                                                               |
| =C-c g=             | =M-x counsel-git=                                                       | Find file in the current git repository.                                                                                                                                                                                                                                                   |
| =C-c j=             | =M-x counsel-git-grep=                                                  | Grep for a string in the current Git repository.                                                                                                                                                                                                                                           |
| =C-c L=             | =M-x counsel-git-log=                                                   | Call the =git log --grep= shell command.                                                                                                                                                                                                                                                     |
| =C-c J=             | =M-x counsel-file-jump=                                                 | Jump to a file below the current directory..                                                                                                                                                                                                                                               |
| =C-c k=             | =M-x counsel-ag=                                                        | Grep for a string in a root directory using =ag=.                                                                                                                                                                                                                                            |
| =C-c l=             | =M-x counsel-locate=                                                    | Call a "locate" style shell command.                                                                                                                                                                                                                                                       |
| =M-y=               | =M-x counsel-yank-pop=                                                  | Ivy replacement for =yank-pop=.                                                                                                                                                                                                                                                              |
| =C-h f=             | =M-x counsel-describe-function=                                         | Forward to =describe-function=.                                                                                                                                                                                                                                                              |
| =C-h i=             | =M-x counsel-info-lookup-symbol=                                        | Forward SYMBOL to =info-lookup-symbol= with ivy completion.                                                                                                                                                                                                                                  |
| =C-h j=             | =M-x counsel-set-variable=                                              | Set a variable SYM with completion.                                                                                                                                                                                                                                                        |
| =C-h l=             | =M-x counsel-find-library=                                              | Find Emacs Lisp source. Forward to =find-library=.                                                                                                                                                                                                                                           |
| =C-h u=             | =M-x counsel-unicode-char=                                              | Insert COUNT copies of a unicode char at point.                                                                                                                                                                                                                                            |
| =C-h v=             | =M-x counsel-describe-variable=                                         | Forward to =describe-function=.                                                                                                                                                                                                                                                              |
| =C-r=               | =M-x counsel-minibuffer-history=                                        | Browse minibuffer history.                                                                                                                                                                                                                                                                 |
| =C-r=               | =M-x counsel-expression-history=                                        | In =read-expression-map=                                                                                                                                                                                                                                                                     |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-x p i=           | =M-x org-cliplink=                                                      | Insert [[https://orgmode.org][org-mode]] links from the clipboard.                                                                                                                                                                                                                                                  |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-z=               | =M-x undo-fu-only-undo=                                                 | Undo the last action.                                                                                                                                                                                                                                                                      |
| =C-S-z=             | =M-x undo-fu-only-redo=                                                 | Redo an action until the initial undo action.                                                                                                                                                                                                                                              |
| =H-m C-z=           | =M-x undo-fu-only-redo-all=                                             | Redo all actions until the initial undo step.                                                                                                                                                                                                                                              |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =s-p=               | =M-x centaur-tabs-backward=                                             | Select the previous available tab.                                                                                                                                                                                                                                                         |
| =s-n=               | =M-x centaur-tabs-forward=                                              | Select the next available tab.                                                                                                                                                                                                                                                             |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-<up>=            | =M-x psimacs/movement/move-text-up=                                     | Move region or line up.                                                                                                                                                                                                                                                                    |
| =H-<down>=          | =M-x psimacs/movement/move-text-down=                                   | Move region or line down.                                                                                                                                                                                                                                                                  |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-;=               | =M-x iedit-mode=                                                        | Toggle [[https://github.com/victorhge/iedit][iedit-mode]].                                                                                                                                                                                                                                                                         |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-b=               | =M-x frog-jump-buffer=                                                  | Presents a /frog-menu/ for jumping to an open buffer.                                                                                                                                                                                                                                        |
| =H-B=               | =M-x frog-jump-buffer-other-window=                                     | Presents a /frog-menu/ for jumping to an open buffer in other window.                                                                                                                                                                                                                        |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-c C-e=           | =M-x edit-indirect-region=                                              | Edit region in separate buffer *edit-indirect buffer*                                                                                                                                                                                                                                        |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-c r=             | =M-x vr/replace=                                                        | =replace-reg-exp= with live visual feedback.                                                                                                                                                                                                                                                 |
| =H-c q=             | =M-x vr/query-replace=                                                  | =query-replace-regexp= with live visual feedback.                                                                                                                                                                                                                                            |
| =H-c m=             | =M-x vr/mc-mark=                                                        | Convert regexp selection to multiple cursors.                                                                                                                                                                                                                                              |
| =H-c s=             | =M-x vr/isearch-forward=                                                | Like =isearch-forward= but with a [[https://en.wikipedia.org/wiki/Perl_Compatible_Regular_Expressions][PCRE]] regular expression.                                                                                                                                                                                                                                   |
| =H-c p=             | =M-x vr/isearch-backward=                                               | Like =isearch-backward= but with a [[https://en.wikipedia.org/wiki/Perl_Compatible_Regular_Expressions][PCRE]] regular expression.                                                                                                                                                                                                                                  |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-g=               | =M-x keyboard-escape-quit=                                              | Quit or abort.                                                                                                                                                                                                                                                                             |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-h f=             | =M-x helpful-callable=                                                  | Show help for function, macro or special form named SYMBOL.                                                                                                                                                                                                                                |
| =H-h F=             | =M-x helpful-function=                                                  | Show help for function named SYMBOL.                                                                                                                                                                                                                                                       |
| =H-h M=             | =M-x helpful-macro=                                                     | Show help for macro named SYMBOL.                                                                                                                                                                                                                                                          |
| =H-h c=             | =M-x helpful-command=                                                   | Show help for interactive function named SYMBOL.                                                                                                                                                                                                                                           |
| =H-h k=             | =M-x helpful-key=                                                       | Show help for interactive command bound to KEY-SEQUENCE.                                                                                                                                                                                                                                   |
| =H-h v=             | =M-x helpful-variable=                                                  | Show help for variable named SYMBOL.                                                                                                                                                                                                                                                       |
| =H-h p=             | =M-x helpful-at-point=                                                  | Show help for the symbol at point.                                                                                                                                                                                                                                                         |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-h C-d m=         | =M-x discover-my-major=                                                 | Create a listing of all major-mode keys with their description.                                                                                                                                                                                                                            |
| =H-h C-d M=         | =M-x discover-my-mode=                                                  | Create a listing of all MODE keys with their description.                                                                                                                                                                                                                                  |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-h H-h b=         | =M-x helm-descbinds=                                                    | Create a listing of all key bindings of current major mode.                                                                                                                                                                                                                                |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-h H-h m=         | =M-x helm-describe-modes=                                               | Create a listing of all modes of current major mode.                                                                                                                                                                                                                                       |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-SPC H-SPC=       | =M-x psimacs/hydra/hydra/body=                                          | Hydra...                                                                                                                                                                                                                                                                                   |
| =H-SPC SPC=         | =M-x psimacs/hydra/toggle/body=                                         | Toggles...                                                                                                                                                                                                                                                                                 |
| =H-SPC a=           | =M-x psimacs/hydra/apropos/body=                                        | Apropos...                                                                                                                                                                                                                                                                                 |
| =H-SPC b=           | =M-x psimacs/hydra/ob/body=                                             | Org-Babel hydra ...                                                                                                                                                                                                                                                                        |
| =H-SPC d=           | =M-x dap-hydra=                                                         | DAP-Mode hydra...                                                                                                                                                                                                                                                                          |
| =H-SPC h=           | =M-x psimacs/hydra/help/body=                                           | Help...                                                                                                                                                                                                                                                                                    |
| =H-SPC H=           | =M-x psimacs/hydra/helpful/body=                                        | Helpful...                                                                                                                                                                                                                                                                                 |
| =H-SPC i=           | =M-x hydra-ivy/body=                                                    | Ivy...                                                                                                                                                                                                                                                                                     |
| =H-SPC j=           | =M-x psimacs/jupyter/org-hydra/body=                                    | Jupyter                                                                                                                                                                                                                                                                                    |
| =H-SPC l=           | =M-x psimacs/hydra/lsp/body=                                            | LSP Mode hydra...                                                                                                                                                                                                                                                                          |
| =H-SPC m=           | =M-x major-mode-hydra=                                                  | Major Mode's hydra...                                                                                                                                                                                                                                                                      |
| =H-SPC p=           | =M-x psimacs/hydra/projectile/body=                                     | Projectile...                                                                                                                                                                                                                                                                              |
| =H-SPC t=           | =M-x psimacs/hydra/avy/body=                                            | Fast Jumping in Text...                                                                                                                                                                                                                                                                    |
| =H-SPC T=           | =M-x psimacs/hydra/transpose/body=                                      | Transposing...                                                                                                                                                                                                                                                                             |
| =H-SPC w=           | =M-x psimacs/hydra/window/body=                                         | Window...                                                                                                                                                                                                                                                                                  |
| =H-SPC y=           | =M-x psimacs/hydra/yasnippet/body=                                      | YASnippet...                                                                                                                                                                                                                                                                               |
| =H-SPC C-c=         | =M-x psimacs/hydra/multiple-cursors/body=                               | Multiple Cursors...                                                                                                                                                                                                                                                                        |
| =H-SPC C-f=         | =M-x psimacs/hydra/flycheck/body=                                       | Flycheck...                                                                                                                                                                                                                                                                                |
| =H-SPC C-i=         | =M-x psimacs/hydra/image+/body=                                         | Image...                                                                                                                                                                                                                                                                                   |
| =H-SPC C-l=         | =M-x psimacs/hydra/vlf-large-files/body=                                | Large Files...                                                                                                                                                                                                                                                                             |
| =H-SPC C-m=         | =M-x psimacs/hydra/word-modes/body=                                     | CamelCase...                                                                                                                                                                                                                                                                               |
| =H-SPC C-o=         | =M-x psimacs/hydra/org/body=                                            | Org-Mode...                                                                                                                                                                                                                                                                                |
| =H-SPC C-p=         | =M-x hydra-projectile-cmake/body=                                       | Projectile CMake...                                                                                                                                                                                                                                                                        |
| =H-SPC C-r=         | =M-x psimacs/hydra/rectangle/body=                                      | Rectangle...                                                                                                                                                                                                                                                                               |
| =H-SPC C-s=         | =M-x psimacs/hydra/straight/body=                                       | Straight...                                                                                                                                                                                                                                                                                |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m (=             | =M-x psimacs/pair/insert-paren=                                         | Insert paranthesis =()=.                                                                                                                                                                                                                                                                    |
| =H-m [=             | =M-x psimacs/pair/insert-bracket=                                       | Insert brackets =[]=.                                                                                                                                                                                                                                                                       |
| =H-m {=             | =M-x psimacs/pair/insert-brace=                                         | Insert braces ={}=.                                                                                                                                                                                                                                                                         |
| =H-m "=             | =M-x psimacs/pair/insert-ascii-double-quote=                            | Insert ascii double quotes =""=.                                                                                                                                                                                                                                                            |
| =H-m '=             | =M-x psimacs/pair/insert-ascii-single-quote=                            | Insert ascii single quotes =''=.                                                                                                                                                                                                                                                            |
| =H-m e=             | =M-x psimacs/pair/insert-emacs-quote=                                   | Insert emacs quotes =`'=.                                                                                                                                                                                                                                                                   |
| =H-m ==             | =M-x psimacs/pair/insert-equal=                                         | Insert equality signs ====.                                                                                                                                                                                                                                                                 |
| =H-m *=             | =M-x psimacs/pair/insert-star=                                          | Insert stars =**=.                                                                                                                                                                                                                                                                          |
| =H-m /=             | =M-x psimacs/pair/insert-slash=                                         | Insert slashes =//=.                                                                                                                                                                                                                                                                        |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =<f12>=             | =M-x cua-mode=                                                          | Toggle CUA mode.                                                                                                                                                                                                                                                                           |
| =H-m c=             | =M-x cua-mode=                                                          | Toggle CUA mode.                                                                                                                                                                                                                                                                           |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-c g s=       | =M-x magit-status=                                                      | Run git status command.                                                                                                                                                                                                                                                                    |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-c C-h=       | =M-x (find-file-read-only history-file)=                                | Open the history file in read-only mode.                                                                                                                                                                                                                                                   |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-e=               | =M-x else-expand=                                                       | Expand the placeholder or any preceeding abbreviation at point.                                                                                                                                                                                                                            |
| =H-E=               | =M-x else-expand-or-next-expand=                                        | Expand if possible else move to next and expand this one.                                                                                                                                                                                                                                  |
| =H-n=               | =M-x else-next=                                                         | Move 'point' to the 'next' placeholder.                                                                                                                                                                                                                                                    |
| =H-p=               | =M-x else-previous=                                                     | Move `point' to the (nth) previous placeholder.                                                                                                                                                                                                                                            |
| =H-N=               | =M-x else-expand-or-next-expand=                                        | Expand if possible else move to next and expand this one.                                                                                                                                                                                                                                  |
| =H-P=               | =M-x else-expand-or-previous-expand=                                    | Expand if possible else move to previous and expand this one.                                                                                                                                                                                                                              |
| =H-C-n=             | =M-x else-kill-or-next-kill=                                            | Kill if possible else move to next and kill this one.                                                                                                                                                                                                                                      |
| =H-C-p=             | =M-x else-kill-or-previous-kill=                                        | Kill if possible else move to previous and kill this one.                                                                                                                                                                                                                                  |
| =H-k=               | =M-x else-kill=                                                         | Kill the placeholder at point.                                                                                                                                                                                                                                                             |
| =H-K=               | =M-x psimacs/else/kill-always=                                          | Like =else-kill= but kills required placeholders without prompting.                                                                                                                                                                                                                          |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-c m=         | =M-x else-mode=                                                         | Enable/disable =else-mode=.                                                                                                                                                                                                                                                                  |
| =H-m C-c e=         | =M-x else-expand=                                                       | Expand the placeholder or any preceeding abbreviation at point.                                                                                                                                                                                                                            |
| =H-m C-c E=         | =M-x else-expand-or-next-expand=                                        | Expand if possible else move to next and expand this one.                                                                                                                                                                                                                                  |
| =H-m C-c n=         | =M-x else-next=                                                         | Move 'point' to the 'next' placeholder.                                                                                                                                                                                                                                                    |
| =H-m C-c p=         | =M-x else-previous=                                                     | Move `point' to the (nth) previous placeholder.                                                                                                                                                                                                                                            |
| =H-m C-c N=         | =M-x else-expand-or-next-expand=                                        | Expand if possible else move to next and expand this one.                                                                                                                                                                                                                                  |
| =H-m C-c P=         | =M-x else-expand-or-previous-expand=                                    | Expand if possible else move to previous and expand this one.                                                                                                                                                                                                                              |
| =H-m C-c C-n=       | =M-x else-kill-or-next-kill=                                            | Kill if possible else move to next and kill this one.                                                                                                                                                                                                                                      |
| =H-m C-c C-p=       | =M-x else-kill-or-previous-kill=                                        | Kill if possible else move to previous and kill this one.                                                                                                                                                                                                                                  |
| =H-m C-c k=         | =M-x else-kill=                                                         | Kill the placeholder at point.                                                                                                                                                                                                                                                             |
| =H-m C-c K=         | =M-x psimacs/else/kill-always=                                          | Like =else-kill= but kills required placeholders without prompting.                                                                                                                                                                                                                          |
| =H-m C-c C-c=       | =M-x else-template-compile-buffer=                                      | Compile the whole current buffer.                                                                                                                                                                                                                                                          |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-RET=             | =M-x jupyter-org-execute-and-next-block=                                | Execute jupyter block and move to next block.                                                                                                                                                                                                                                              |
| =C-S-H-<return>=    | =M-x psimacs/jupyter/execute-all-jupyter-src-blocks=                    | Execute all jupyter blocks.                                                                                                                                                                                                                                                                |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m n=             | =M-x psimacs/jupyter/next-jupyter-src-block=                            | Move point into the next jupyter src block.                                                                                                                                                                                                                                                |
| =H-m p=             | =M-x psimacs/jupyter/previous-jupyter-src-block=                        | Move point into the previous jupyter src block.                                                                                                                                                                                                                                            |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m i d=           | =M-x org-display-inline-images=                                         | Display inline images.                                                                                                                                                                                                                                                                     |
| =H-m i r=           | =M-x org-redisplay-inline-images=                                       | Redisplay inline images.                                                                                                                                                                                                                                                                   |
| =H-m i t=           | =M-x org-toogle-inline-images=                                          | Toogle inline images.                                                                                                                                                                                                                                                                      |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-e C-m v=     | =M-x visual-line-mode=                                                  | Line wrapping. See [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Visual-Line-Mode.html][Visual Line Mode]].                                                                                                                                                                                                                                                       |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-f m=         | =M-x flyspell-mode=                                                     | Minor mode performing on-the-fly spelling checking.                                                                                                                                                                                                                                        |
| =H-m C-f M=         | =M-x flyspell-prog-mode=                                                | Turn on [[http://www-sop.inria.fr/members/Manuel.Serrano/flyspell/flyspell.html][flyspell-mode]] for comments and strings.                                                                                                                                                                                                                                            |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-f r=         | =M-x flyspell-region=                                                   | Checks all words inside a region.                                                                                                                                                                                                                                                          |
| =H-m C-f b=         | =M-x flyspell-buffer=                                                   | Checks the whole buffer.                                                                                                                                                                                                                                                                   |
| =H-m C-f w=         | =M-x flyspell-word=                                                     | Spell check a word.                                                                                                                                                                                                                                                                        |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-,=               | =M-x flyspell-goto-next-error=                                          | Go to the next detected error.                                                                                                                                                                                                                                                             |
| =C-.=               | =M-x flyspell-auto-correct-word=                                        | Automatically Correct the current word. This command proposes various successive corrections for the current word.                                                                                                                                                                         |
| =C-:=               | =M-x flyspell-auto-correct-previous-word=                               | Auto correct the first mispelled word that occurs before point.                                                                                                                                                                                                                            |
| =C-;=               | =M-x flyspell-correct-wrapper=                                          | By default jumps to the first misspelled word before the point and prompts for correction and gets you back. Calling it with =C-u= gives ability to correct multiple misspelled words in one run. =C-u C-u= changes direction. =C-u C-u C-u= changes direction and enables multiple corrections. |
| =H-m C-f a=         | =M-x flyspell-correct-at-point=                                         | To correct word at point.                                                                                                                                                                                                                                                                  |
| =H-m C-f p=         | =M-x flyspell-correct-previous=                                         | To correct any visible word before the point.                                                                                                                                                                                                                                              |
| =H-m C-f n=         | =M-x flyspell-correct-next=                                             | To correct any visible word after the point.                                                                                                                                                                                                                                               |
| =H-m C-f c=         | =M-x flyspell-check-previous-highlighted-word=                          | Correct the closer misspelled word.                                                                                                                                                                                                                                                        |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-f d=         | =M-x psimac/spell/add-word-to-dict=                                     | Add the word at the current location to the private dictionary without question.                                                                                                                                                                                                           |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-f g=         | =M-x psimac/spell/switch-to-german=                                     | Change to german language dictionary.                                                                                                                                                                                                                                                      |
| =H-m C-f e=         | =M-x psimac/spell/switch-to-english=                                    | Change to english language dictionary.                                                                                                                                                                                                                                                     |
| =H-m C-f t=         | =M-x psimac/spell/toggle-language=                                      | Toggle german and english language dictionaries.                                                                                                                                                                                                                                           |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-f C-a c=     | =M-x find-file <psimacs/config/org-capture-coding-diary-file>=          | Find coding diary file in agenda directory.                                                                                                                                                                                                                                                |
| =H-m C-f C-a d=     | =M-x find-file <Diary.org>=                                             | Find diary file in agenda directory.                                                                                                                                                                                                                                                       |
| =H-m C-f C-a j=     | =M-x find-file <Journal.org>=                                           | Find journal file in agenda directory.                                                                                                                                                                                                                                                     |
| =H-m C-f C-a l=     | =M-x find-file <TimeLog.org>=                                           | Find time log file in agenda directory.                                                                                                                                                                                                                                                    |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-f C-f=       | =M-x find-function=                                                     | Find the definition of function near point                                                                                                                                                                                                                                                 |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-l b=         | =M-x langtool-check-buffer=                                             | To check current buffer and show warnings. With prefix =C-u= check with different language.                                                                                                                                                                                                  |
| =H-m C-l p=         | =M-x langtool-goto-previous-error=                                      | Goto previous error. Obsoleted function. Should use =langtool-correct-buffer=.                                                                                                                                                                                                               |
| =H-m C-l n=         | =M-x langtool-goto-next-error=                                          | Goto next error. Obsoleted function. Should use =langtool-correct-buffer=.                                                                                                                                                                                                                   |
| =H-m C-l ;=         | =M-x langtool-correct-buffer=                                           | Execute interactive correction after =langtool-check-buffer=. To correct marker follow LanguageTool suggestions.                                                                                                                                                                             |
| =H-m C-l t=         | =M-x langtool-switch-default-language=                                  | Switch langtool-default-language to LANG                                                                                                                                                                                                                                                 |
| =H-m C-l m=         | =M-x langtool-show-brief-message-at-point=                              | Show error brief message at point.                                                                                                                                                                                                                                                         |
| =H-m C-l M=         | =M-x langtool-show-message-at-point=                                    | Show error details at point..                                                                                                                                                                                                                                                              |
| =H-m C-l B=         | =M-x langtool-check-done=                                               | Finish LanguageTool process and cleanup existing colorized texts.                                                                                                                                                                                                                          |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-m C-v w=     | =M-x whitespace-mode=                                                   | Toggle  [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Useless-Whitespace.html][whitespace-mode]].                                                                                                                                                                                                                                                                   |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-m C-v f=     | =M-x global-display-fill-column-indicator-mode=                         | Toggle the display of the fill column indicator.                                                                                                                                                                                                                                           |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-p C-b=       | =M-x psimacs/pair/bounce-sexp=                                          | Will bounce between matching parens.                                                                                                                                                                                                                                                       |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-p C-f p=     | =M-x ps-print-buffer-with-faces=                                        | Color print buffer via Ghostscript                                                                                                                                                                                                                                                         |
| =H-m C-p C-f r=     | =M-x ps-print-region-with-faces=                                        | Color print region via Ghosts                                                                                                                                                                                                                                                              |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-p C-p b=     | =M-x print-buffer=                                                      | B/W print hardcopy of buffer on default printer                                                                                                                                                                                                                                            |
| =H-m C-p C-p r=     | =M-x print-region=                                                      | B/W print hardcopy of region on default printer                                                                                                                                                                                                                                            |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-p C-q p=     | =M-x ps-print-buffer=                                                   | B/W print buffer via Ghostscript                                                                                                                                                                                                                                                           |
| =H-m C-p C-q r=     | =M-x ps-print-region=                                                   | B/W print region via Ghostscript                                                                                                                                                                                                                                                           |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-p C-r C-p=   | =M-x psimacs/pair/rainbow-toggle-sized-delimiters=                      | Toggle the size of the rainbow-delimiters.                                                                                                                                                                                                                                                 |
| =H-m C-p C-r M-C-p= | =M-x psimacs/pair/rainbow-sized-delimiters=                             | All rainbow delimiters have various heights.                                                                                                                                                                                                                                               |
| =H-m C-p C-r S-C-p= | =M-x psimacs/pair/rainbow-non-sized-delimiters=                         | All rainbow delimiters have the same height. This is the default.                                                                                                                                                                                                                          |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-s C-a c=     | =M-x avy-goto-char=                                                     | Input one char, jump to it with a tree.                                                                                                                                                                                                                                                    |
| =H-m C-s C-a C=     | =M-x avy-goto-char-2=                                                   | Input two consecutive chars, jump to the first one with a tree.                                                                                                                                                                                                                            |
| =H-m C-s C-a t=     | =M-x avy-goto-char-timer=                                               | Input an arbitrary amount of consecutive chars, jump to the first one with a tree.                                                                                                                                                                                                         |
| =H-m C-s C-a T=     | =M-x avy-org-goto-heading-timer=                                        | Type part of an Org heading. When you stop typing it will be jumped to; if more than one matches, you can jump to a heading with Avy.                                                                                                                                                      |
| =H-m C-s C-a l=     | =M-x avy-goto-line=                                                     | Input zero chars, jump to a line start with a tree.                                                                                                                                                                                                                                        |
| =H-m C-s C-a w=     | =M-x avy-goto-word-1=                                                   | Input one char at word start, jump to a word start with a tree.                                                                                                                                                                                                                            |
| =H-m C-s C-a W=     | =M-x avy-goto-word-0=                                                   | Input zero chars, jump to a word start with a tree.                                                                                                                                                                                                                                        |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-s C-m f=     | =M-x mosey-forward=                                                     | Mosey on forward.                                                                                                                                                                                                                                                                          |
| =H-m C-s C-m b=     | =M-x mosey-backward=                                                    | Mosey on back.                                                                                                                                                                                                                                                                             |
| =H-m C-s C-m F=     | =M-x mosey-forward-bounce=                                              | Bounce forward a notch when it hits the beginning.                                                                                                                                                                                                                                         |
| =H-m C-s C-m B=     | =M-x mosey-backward-bounce=                                             | Bounce back a notch when it hits the end.                                                                                                                                                                                                                                                  |
| =H-m C-s C-m C-f=   | =M-x mosey-forward-cycle=                                               | Loop around when it gets to one end or the other.                                                                                                                                                                                                                                          |
| =H-m C-s C-m C-b=   | =M-x mosey-backward-cycle=                                              | Loop around when it gets to one end or the other.                                                                                                                                                                                                                                          |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-s a=         | =M-x swiper-all=                                                        | Incrementally search in all open buffers.                                                                                                                                                                                                                                                  |
| =H-m C-s s=         | =M-x isearch-forward=                                                   | Incrementally search forward.                                                                                                                                                                                                                                                              |
| =H-m C-s r=         | =M-x isearch-backward=                                                  | Incrementally search backward.                                                                                                                                                                                                                                                             |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-s w RET=     | =M-x counsel-search=                                                    | Interactively search the web with counsel.                                                                                                                                                                                                                                                 |
| =H-m C-s w t=       | =M-x psimacs/web/counsel/toggle-search-engine=                          | Toggle the search engine of 'counsel-search' between duckduckgo and google.                                                                                                                                                                                                                |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-t ;=         | =M-x google-translate-smooth-translate=                                 | Translate a text using translation directions. Make a prompt in minibuffer for a text to translate. Default text is word at point.                                                                                                                                                         |
| =H-m C-t o=         | =M-x psimacs/spell/google-tanslate/toggle-output-destination=           | Toggle output desination between 'current buffer' and 'translation buffer'.                                                                                                                                                                                                                |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-u C-w t=     | =M-x psimacs/which-key/toggle-sort-order=                               | Toggle the which-key-mode sort order.                                                                                                                                                                                                                                                      |
| =H-m C-u C-w c=     | =M-x psimacs/which-key/cycle-sort-order=                                | Cycle through the which-key-mode sort orders.                                                                                                                                                                                                                                              |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-v C-o=       | =M-x psimacs/shell/open-file-in-visual-studio=                          | Open the given file argument in the MS Visual Studion session.                                                                                                                                                                                                                             |
| =H-m C-v C-i=       | =M-x psimacs/shell/import-file-in-visual-studio=                        | Import the given file argument in the MS Visual Studion session.                                                                                                                                                                                                                           |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-x o=             | =M-x ace-window=                                                        | Either =other-window= or easy switching by first character of window label. Swap window with prefix =C-u= and delete selected window with double prefix =C-u C-u=.                                                                                                                               |
| =C-x O=             | =M-x other-frame=                                                       | Switch to the next frame in ring.                                                                                                                                                                                                                                                          |
| =H-m C-w C-x s=     | =M-x psimacs/config/toggle-ace-scope=                                   | Toggle scope of [[https://github.com/abo-abo/ace-window][ace-window]] between 'global' and 'frame' scope.                                                                                                                                                                                                                             |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-w C-x 5 l=   | =M-x psimacs/window/set-frame-creation-strategy-layout=                 | Place and size new frames left and right to the main frame. This is the default strategy.                                                                                                                                                                                                  |
| =H-m C-w C-x 5 m=   | =M-x psimacs/window/set-frame-creation-strategy-main=                   | Always use the same placement and size as the initial main frame.                                                                                                                                                                                                                          |
| =H-m C-w C-x 5 s=   | =M-x psimacs/window/set-frame-creation-strategy-system=                 | Let Emacs and the operating system decide.                                                                                                                                                                                                                                                 |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-w C-s s=     | =M-x smooth-scrolling-mode=                                             | Enable or disable the smooth scrolling mode.                                                                                                                                                                                                                                               |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-w C-r=       | =M-x golden-ratio-mode=                                                 | Toggle automatic window resizing with golden ratio.                                                                                                                                                                                                                                        |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-w +=         | =M-x zoom=                                                              | Zoom the current window and balance the others according to =zoom-size=.                                                                                                                                                                                                                     |
| =H-m C-w C-z=       | =M-x zoom-mode=                                                         | Toggle automatic window resizing with zoom.                                                                                                                                                                                                                                                |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-x G SPC=     | =M-x google-this-region=                                                | Google the current region. PREFIX determines quoting.                                                                                                                                                                                                                                      |
| =H-m C-x G a=       | =M-x google-this-ray=                                                   | Google text between the point and end of the line. If there is a selected region, googles the region.                                                                                                                                                                                      |
| =H-m C-x G c=       | =M-x google-this-translate-query-or-region=                             | If region is active =google-translate-at-point=, otherwise =google-translate-query-translate=.                                                                                                                                                                                                 |
| =H-m C-x G e=       | =M-x google-this-error=                                                 | Google the current error in the compilation buffer. PREFIX determines quoting.                                                                                                                                                                                                             |
| =H-m C-x G f=       | =M-x google-this-forecast=                                              | Search google for "weather". With PREFIX, ask for location.                                                                                                                                                                                                                                |
| =H-m C-x G g=       | =M-x google-this-lucky-search=                                          | Exactly like =google-this-search=, but use the "Im feeling lucky" option. PREFIX determines quoting.                                                                                                                                                                                        |
| =H-m C-x G i=       | =M-x google-this-lucky-and-insert-url=                                  | Fetch the url that would be visited by google-this-lucky.                                                                                                                                                                                                                                |
| =H-m C-x G l=       | =M-x google-this-line=                                                  | Google the current line. PREFIX determines quoting.                                                                                                                                                                                                                                        |
| =H-m C-x G m=       | =M-x google-maps=                                                       |                                                                                                                                                                                                                                                                                            |
| =H-m C-x G n=       | =M-x google-this-noconfirm=                                             | Decide what the user wants to google and go without confirmation. Exactly like =google-this= or =google-this-search=, but dont ask for confirmation.                                                                                                                                          |
| =H-m C-x G r=       | =M-x google-this-cpp-reference=                                         | Visit the most probable cppreference.com page for this word.                                                                                                                                                                                                                               |
| =H-m C-x G s=       | =M-x google-this-symbol=                                                | Google the current symbol.                                                                                                                                                                                                                                                                 |
| =H-m C-x G t=       | =M-x google-this=                                                       | Decide what the user wants to google (always something under point). Unlike =google-this-search= (which presents an empty prompt with "this" as the default value), this function inserts the query in the minibuffer to be edited.                                                          |
| =H-m C-x G w=       | =M-x google-this-word=                                                  | Google the current word.                                                                                                                                                                                                                                                                   |
| =H-m C-x G RET=     | =M-x google-this-search=                                                | Write and do a google search.                                                                                                                                                                                                                                                              |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-x s b=       | =M-x psimacs/convenience/bind-f6-to-last-command=                       | Bind function key F6 to the last command used.                                                                                                                                                                                                                                             |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-x S RET=     | =M-x sx-tab-all-questions=                                              | Display a list of All-Questions questions for SITE.                                                                                                                                                                                                                                        |
| =H-m C-x S s=       | =M-x sx-search=                                                         | Display search on SITE for question titles containing QUERY.                                                                                                                                                                                                                               |
| =H-m C-x S r=       | =M-x sx-question-list-refresh=                                          | Update the list of questions.                                                                                                                                                                                                                                                              |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-x C-t=       | =M-x treemacs=                                                          | Open [[https://github.com/Alexander-Miller/treemacs][treemacs]].                                                                                                                                                                                                                                                                             |
| =H-m C-x t t=       | =M-x treemacs-select-window=                                            | Select the [[https://github.com/Alexander-Miller/treemacs][treemacs]] window.                                                                                                                                                                                                                                                                |
| =H-m C-x t 1=       | =M-x treemacs-delete-other-windows=                                     | Same as =delete-other-window= but does not delete the [[https://github.com/Alexander-Miller/treemacs][treemacs]] window.                                                                                                                                                                                                                       |
| =H-m C-x t B=       | =M-x treemacs-bookmark=                                                 | Find a bookmark in [[https://github.com/Alexander-Miller/treemacs][treemacs]].                                                                                                                                                                                                                                                               |
| =H-m C-x t C-t=     | =M-x treemacs-find-file=                                                | Find and focus the current file in the current [[https://github.com/Alexander-Miller/treemacs][treemacs]] window.                                                                                                                                                                                                                            |
| =H-m C-x t M-t=     | =M-x treemacs-find-tag=                                                 | Find and move the point to the tag at point in the [[https://github.com/Alexander-Miller/treemacs][treemacs]] view.                                                                                                                                                                                                                          |
| =H-m C-x t p=       | =M-x treemacs-projectile=                                               | Add one of =projectile-known-projects= to the [[https://github.com/Alexander-Miller/treemacs][treemacs]] workspace.                                                                                                                                                                                                                            |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-x C-n=       | =M-x neotree-toggle=                                                    | Open [[https://github.com/jaypei/emacs-neotree][Neotree]].                                                                                                                                                                                                                                                                              |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-x C-a=       | =M-x abbrev-mode=                                                       | Enable/Disable abbreviation mode.                                                                                                                                                                                                                                                          |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-y w=         | =M-x aya-create=                                                        | Create a snippet from the text between BEG and END.                                                                                                                                                                                                                                        |
| =H-m C-y TAB=       | =M-x aya-expand=                                                        | Insert the last yasnippet created by =aya-create=.                                                                                                                                                                                                                                           |
| =H-m C-y SPC=       | =M-x aya-expand-from-history=                                           | Select and insert a yasnippet from the =aya-history=.                                                                                                                                                                                                                                        |
| =H-m C-y d=         | =M-x aya-delete-from-history=                                           | Select and delete one or more snippets from =aya-history=.                                                                                                                                                                                                                                   |
| =H-m C-y c=         | =M-x aya-clear-history=                                                 | Clear =aya-history=.                                                                                                                                                                                                                                                                         |
| =H-m C-y n=         | =M-x aya-next-in-history=                                               | Set =aya-current= to the next item in history. Wraps at the end of history.                                                                                                                                                                                                                  |
| =H-m C-y p=         | =M-x aya-previous-in-history=                                           | Set =aya-current= to the previous item in history. Wraps around at start of history.                                                                                                                                                                                                         |
| =H-m C-y s=         | =M-x aya-persist-snippet=                                               | Save the current auto-snippet to a user snippets folder. The current =major-mode= name will be used to determine the snippets sub-directory to store the snippet.                                                                                                                            |
| =H-m C-y o=         | =M-x aya-open-line=                                                     | Generic expansion function. It will either expand or move to the next field depending on the context.                                                                                                                                                                                      |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m H-c e l=       | =M-x mc/edit-lines=                                                     | Add one cursor to each line of the active region.                                                                                                                                                                                                                                          |
| =H-m H-c e C-a=     | =M-x mc/edit-beginnings-of-lines=                                       | Add one cursor to the beginning of each line in the active region.                                                                                                                                                                                                                         |
| =H-m H-c e C-e=     | =M-x mc/edit-ends-of-lines=                                             | Add one cursor to the end of each line in the active region.                                                                                                                                                                                                                               |
| =H-m H-c i n=       | =M-x mc/insert-numbers=                                                 | Insert increasing numbers for each cursor, starting at 0.                                                                                                                                                                                                                                  |
| =H-m H-c m n=       | =M-x mc/mark-next-like-this=                                            | Find and mark the next part of the buffer matching the currently active region                                                                                                                                                                                                             |
| =H-m H-c m p=       | =M-x mc/mark-previous-like-this=                                        | Find and mark the prev part of the buffer matching the currently active region                                                                                                                                                                                                             |
| =H-m H-c m a=       | =M-x mc/mark-all-like-this=                                             | Find and mark all the parts of the buffer matching the currently active region                                                                                                                                                                                                             |
| =H-m H-c m d=       | =M-x mc/mark-all-symbols-like-this-in-defun=                            | Mark all symbols like this in defun.                                                                                                                                                                                                                                                       |
| =H-m H-c u n=       | =M-x mc/unmark-next-like-this=                                          | Deselect next part of the buffer matching the currently active region.                                                                                                                                                                                                                     |
| =H-m H-c u p=       | =M-x mc/unmark-previous-like-this=                                      | Deselect prev part of the buffer matching the currently active region.                                                                                                                                                                                                                     |
| =H-m H-c r r=       | =M-x mc/reverse-regions=                                                |                                                                                                                                                                                                                                                                                            |
| =H-m H-c r s=       | =M-x mc/sort-regions=                                                   |                                                                                                                                                                                                                                                                                            |
| =H-m H-c h m=       | =M-x mc-hide-unmatched-lines-mode=                                      | Minor mode when enabled hides all lines where no cursors is.                                                                                                                                                                                                                               |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m H-l=           | =M-x string-inflection-all-cycle=                                       | foo_bar => FOO_BAR => FooBar => fooBar => foo-bar => Foo_Bar => foo_bar.                                                                                                                                                                                                                   |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m H-x x=         | =M-x amx-major-mode-commands=                                           | Runs [[https://github.com/DarwinAwardWinner/amx][Amx]], limited to commands that are relevant to the active major mode.                                                                                                                                                                                                                  |
| =H-m H-x m=         | =M-x amx-mode=                                                          | Toggle [[https://github.com/DarwinAwardWinner/amx][amx-mode]].                                                                                                                                                                                                                                                                           |
| =H-m H-x u=         | =M-x amx-show-unbound-commands=                                         | Shows frequently used commands that have no key bindings.                                                                                                                                                                                                                                  |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-m C-p C-s t=     | =M-x psimacs/activate/toggle-smartparens-paren-mode=                    | Toggle between  [[https://github.com/Fuco1/smartparens][smartparens-mode]] and [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Matching.html#Matching][show-paren-mode]].                                                                                                                                                                                                                                      |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-p C-f=           | =M-x sp-forward-sexp=                                                   | Move forward across one balanced expression.                                                                                                                                                                                                                                               |
| =H-p C-b=           | =M-x sp-backward-sexp=                                                  | Move backward across one balanced expression.                                                                                                                                                                                                                                              |
| =H-p M-F=           | =M-x sp-forward-symbol=                                                 | Move point to the next position that is the end of a symbol.                                                                                                                                                                                                                               |
| =H-p M-B=           | =M-x sp-backward-symbol=                                                | Move point to the next position that is the beginning of a symbol.                                                                                                                                                                                                                         |
| =H-p C-n=           | =M-x sp-next-sexp=                                                      | Move forward to the beginning of next balanced expression.                                                                                                                                                                                                                                 |
| =H-p C-p=           | =M-x sp-previous-sexp=                                                  | Move backward to the end of previous balanced expression.                                                                                                                                                                                                                                  |
| =H-p C-u=           | =M-x sp-up-sexp=                                                        | Move forward out of one level of parentheses.                                                                                                                                                                                                                                              |
| =H-p C-d=           | =M-x sp-down-sexp=                                                      | Move forward down one level of sexp.                                                                                                                                                                                                                                                       |
| =H-p M-u=           | =M-x sp-backward-up-sexp=                                               | Move backward out of one level of parentheses.                                                                                                                                                                                                                                             |
| =H-p M-d=           | =M-x sp-backward-down-sexp=                                             | Move backward down one level of sexp.                                                                                                                                                                                                                                                      |
| =H-p C-a=           | =M-x sp-beginning-of-sexp=                                              | Jump to beginning of the sexp the point is in.                                                                                                                                                                                                                                             |
| =H-p C-e=           | =M-x sp-end-of-sexp=                                                    | Jump to end of the sexp the point is in.                                                                                                                                                                                                                                                   |
| =H-p M-a=           | =M-x sp-beginning-of-next-sexp=                                         | Jump to beginning of the next sexp on the same depth.                                                                                                                                                                                                                                      |
| =H-p M-e=           | =M-x sp-beginning-of-previous-sexp=                                     | Jump to beginning of the previous sexp on the same depth.                                                                                                                                                                                                                                  |
| =H-p C-t=           | =M-x sp-transpose-sexp=                                                 | Transpose the expressions around point.                                                                                                                                                                                                                                                    |
| =H-p M-t=           | =M-x sp-transpose-hybrid-sexp=                                          | Transpose the hybrid sexps around point.                                                                                                                                                                                                                                                   |
| =H-p C-j=           | =M-x sp-join-sexp=                                                      | Join the sexp before and after point if they are of the same depth.                                                                                                                                                                                                                        |
| =H-p C-v=           | =M-x sp-convolute-sexp=                                                 | Convolute balanced expressions.                                                                                                                                                                                                                                                            |
| =H-p C-i=           | =M-x sp-indent-defun=                                                   | Reindent the current defun.                                                                                                                                                                                                                                                                |
| =H-p C-m=           | =M-x sp-mark-sexp=                                                      | Set mark /ARG/ balanced expressions from point.                                                                                                                                                                                                                                              |
| =H-p C-k=           | =M-x sp-kill-sexp=                                                      | Kill the balanced expression following point.                                                                                                                                                                                                                                              |
| =H-p M-w=           | =M-x sp-copy-sexp=                                                      | Copy the following ARG expressions to the kill-ring.                                                                                                                                                                                                                                       |
| =H-p M-DEL=         | =M-x sp-unwrap-sexp=                                                    | Unwrap the following expression.                                                                                                                                                                                                                                                           |
| =H-p M-BCK=         | =M-x sp-backward-unwrap-sexp=                                           | Unwrap the previous expression.                                                                                                                                                                                                                                                            |
| =H-p C-<right>=     | =M-x sp-forward-slurp-sexp=                                             | Add sexp following the current list in it by moving the closing delimiter.                                                                                                                                                                                                                 |
| =H-p C-<left>=      | =M-x sp-backward-slurp-sexp=                                            | Add the sexp preceding the current list in it by moving the opening delimiter                                                                                                                                                                                                              |
| =H-p M-<right>=     | =M-x sp-forward-barf-sexp=                                              | Remove the last sexp in the current list by moving the closing delimiter.                                                                                                                                                                                                                  |
| =H-p M-<left>=      | =M-x sp-backward-barf-sexp=                                             | This is exactly like calling sp-forward-barf-sexp with minus ARG.                                                                                                                                                                                                                        |
| =H-p M-D=           | =M-x sp-splice-sexp=                                                    | Unwrap the current list.                                                                                                                                                                                                                                                                   |
| =H-p C-M-DEL=       | =M-x sp-splice-sexp-killing-forward=                                    | Unwrap the current list and kill all the expressions between.                                                                                                                                                                                                                              |
| =H-p C-M-BCK=       | =M-x sp-splice-sexp-killing-backward=                                   | Unwrap the current list and kill all the expressions.                                                                                                                                                                                                                                      |
| =H-p C-S-BCK=       | =M-x sp-splice-sexp-killing-around=                                     | Unwrap the current list and kill everything inside except next expression.                                                                                                                                                                                                                 |
| =H-p C-s N=         | =M-x sp-select-next-thing-exchange=                                     | Just like =sp-select-next-thing= but run =exchange-point-and-mark= afterwards.                                                                                                                                                                                                                 |
| =H-p C-s n=         | =M-x sp-select-next-thing=                                              | Set active region over next thing as recognized by 'sp-get-thing'.                                                                                                                                                                                                                         |
| =H-p C-s p=         | =M-x sp-select-previous-thing=                                          | Set active region over ARG previous things as recognized by 'sp-get-thing'.                                                                                                                                                                                                                |
| =H-p C-c i=         | =M-x sp-change-inner=                                                   | Change the inside of the next expression.                                                                                                                                                                                                                                                  |
| =H-p M-c e=         | =M-x sp-change-enclosing=                                               | Change the inside of the enclosing expression.                                                                                                                                                                                                                                             |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-x C-RET=         | =M-x cua-set-rectangle-mark=                                            | Start a rectangle.                                                                                                                                                                                                                                                                         |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-x r=             | =M-x recentf-open-files=                                                | Show a dialog to open a recent file.                                                                                                                                                                                                                                                       |
| =H-x C-r=           | =M-x recentf-open-more-files=                                           | Show a dialog to open a recent file that is not in the menu.                                                                                                                                                                                                                               |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-x e=             | =M-x er/expand-region=                                                  | Expand region intelligently.                                                                                                                                                                                                                                                               |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-x f=             | =M-x counsel-recentf=                                                   | Find a file on recent file list.                                                                                                                                                                                                                                                           |
| =H-x C-f=           | =M-x counsel-buffer-or-recentf=                                         | Find a buffer visiting a file or file on recent file list.                                                                                                                                                                                                                                 |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-x l=             | =M-x org-store-link=                                                    | Store a link to the current location.                                                                                                                                                                                                                                                      |
| =H-x a=             | =M-x org-agenda=                                                        | Dispatch agenda commands to collect entries to the agenda buffer.                                                                                                                                                                                                                          |
| =H-x c=             | =M-x org-capture=                                                       | Capture something                                                                                                                                                                                                                                                                          |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-x C-c C-e s h=   | =M-x psimacs/sphinx/org-sphinx-build=                                   | Run the sphinx-build tool for the current org buffer.                                                                                                                                                                                                                                      |
| =H-x C-c C-e s H=   | =M-x psimacs/sphinx/build=                                              | Run the sphinx-build tool for the given file.                                                                                                                                                                                                                                              |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-M-b=             | =M-x python-nav-backward-block=                                         | Moves to the previous python block.                                                                                                                                                                                                                                                        |
| =H-M-f=             | =M-x python-nav-forward-block=                                          | Moves to the next python block.                                                                                                                                                                                                                                                            |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-x C-c r=         | =M-x psimacs/python/remove-unused-imports=                              | Removes unused imports and unused variables with [[https://github.com/myint/autoflake][autoflake]].                                                                                                                                                                                                                                |
| =H-x C-c R=         | =M-x psimacs/python/blacken=                                            | Reformat buffer with tool [[https://github.com/psf/black][black]].                                                                                                                                                                                                                                                           |
| =H-x C-c R=         | =M-x psimacs/cmake/format-buffer=                                       | Reformat buffer with tool [[https://github.com/cheshirekow/cmake_format][cmake-format]].                                                                                                                                                                                                                                                    |
| =H-x C-c Y=         | =M-x psimacs/python/yapify=                                             | Reformat buffer with tool [[https://github.com/google/yapf][yapf]].                                                                                                                                                                                                                                                            |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-x p=             | =M-x pop-to-mark-command=                                               | Jump to mark, and pop a new position for mark off the local mark ring (this does not affect the global mark ring).                                                                                                                                                                         |
| =H-x q=             | =M-x pop-global-mark=                                                   | Jump to a mark off the global mark ring.                                                                                                                                                                                                                                                   |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-x x=             | =M-x yas-insert-snippet=                                                | Choose a snippet to expand, popup a list of choices according.                                                                                                                                                                                                                             |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-x C c=           | =M-x recentf-cleanup=                                                   | Cleanup the recent file list.                                                                                                                                                                                                                                                              |
| =H-x C C-c=         | =M-x psimacs/config/recentf-cleanup-directory-files=                    | Remove all files of DIR from recent file list.                                                                                                                                                                                                                                             |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-x C-w d=         | =M-x psimacs/whitespace/delete-trailing-whitespace=                     | Delete trailing white spaces.                                                                                                                                                                                                                                                              |
| =H-x C-w t=         | =M-x psimacs/whitespace/toggle-auto-delete-trailing-whitespace-on-save= | Toggle auto deletion of white spaces on buffer save.                                                                                                                                                                                                                                       |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-x H-f h=         | =M-x yafolding-hide-element=                                            | Hide element.                                                                                                                                                                                                                                                                              |
| =H-x H-f s=         | =M-x yafolding-show-element=                                            | Show element.                                                                                                                                                                                                                                                                              |
| =H-x H-f t=         | =M-x yafolding-toggle-element=                                          | Toggle element.                                                                                                                                                                                                                                                                            |
| =H-x H-f H=         | =M-x yafolding-hide-all=                                                | Hide all elements.                                                                                                                                                                                                                                                                         |
| =H-x H-f S=         | =M-x yafolding-show-all=                                                | Show all elements.                                                                                                                                                                                                                                                                         |
| =H-x H-f T=         | =M-x yafolding-toggle-all=                                              | Toggle all elements.                                                                                                                                                                                                                                                                       |
| =H-x H-f p=         | =M-x yafolding-go-parent-element=                                       | Go to parent element.                                                                                                                                                                                                                                                                      |
| =H-x H-f P=         | =M-x yafolding-hide-parent-element=                                     | Hide parent element.                                                                                                                                                                                                                                                                       |
| =H-x H-f m=         | =M-x yafolding-mode=                                                    | Toggle [[https://github.com/zenozeng/yafolding.el][yafolding-mode]].                                                                                                                                                                                                                                                                     |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =H-x H-x C-c o=     | =M-x crux-open-with=                                                    | Open the currently visited file with an external program.                                                                                                                                                                                                                                  |
| =H-x H-x C-k=       | =M-x crux-smart-kill-line=                                              | First kill to end of line, then kill the whole line.                                                                                                                                                                                                                                       |
| =H-x H-x C-S-RET=   | =M-x crux-smart-open-line-above=                                        | Insert an empty line above the current line and indent it properly.                                                                                                                                                                                                                        |
| =H-x H-x S-RET=     | =M-x crux-smart-open-line=                                              | Insert an empty line and indent it properly (as in most IDEs).                                                                                                                                                                                                                             |
| =H-x H-x C-c n=     | =M-x crux-cleanup-buffer-or-region=                                     | Fix indentation in buffer and strip whitespace.                                                                                                                                                                                                                                            |
| =H-x H-x C-c f=     | =M-x crux-recentf-find-file=                                            | Open recently visited file.                                                                                                                                                                                                                                                                |
| =H-x H-x C-c u=     | =M-x crux-view-url=                                                     | Open a new buffer containing the contents of URL.                                                                                                                                                                                                                                          |
| =H-x H-x C-c e=     | =M-x crux-eval-and-replace=                                             | Eval a bit of Emacs Lisp code and replace it with its result.                                                                                                                                                                                                                              |
| =H-x H-x C-x 4 t=   | =M-x crux-transpose-windows=                                            | Transpose the buffers between two windows.                                                                                                                                                                                                                                                 |
| =H-x H-x C-c D=     | =M-x crux-delete-file-and-buffer=                                       | Delete current file and buffer.                                                                                                                                                                                                                                                            |
| =H-x H-x C-c c=     | =M-x crux-copy-file-preserve-attributes=                                | Copy current file with file attributes preserved                                                                                                                                                                                                                                           |
| =H-x H-x C-c d=     | =M-x crux-duplicate-current-line-or-region=                             | Duplicate the current line (or region).                                                                                                                                                                                                                                                    |
| =H-x H-x C-c M-d=   | =M-x crux-duplicate-and-comment-current-line-or-region=                 | Duplicate and comment the current line (or region).                                                                                                                                                                                                                                        |
| =H-x H-x C-c r=     | =M-x crux-rename-file-and-buffer=                                       | Rename the current buffer and its visiting file if any.                                                                                                                                                                                                                                    |
| =H-x H-x C-c t=     | =M-x crux-visit-term-buffer=                                            | Open a terminal emulator (ansi-term).                                                                                                                                                                                                                                                      |
| =H-x H-x C-c k=     | =M-x crux-kill-other-buffers=                                           | Kill all open buffers except the one you're currently in.                                                                                                                                                                                                                                  |
| =H-x H-x C-M z=     | =M-x crux-indent-defun=                                                 | Indent the definition at point.                                                                                                                                                                                                                                                            |
| =H-x H-x C-c TAB=   | =M-x crux-indent-rigidly-and-copy-to-clipboard=                         | Indent and copy region to clipboard                                                                                                                                                                                                                                                        |
| =H-x H-x C-c I=     | =M-x crux-find-user-init-file=                                          | Open user's init file.                                                                                                                                                                                                                                                                     |
| =H-x H-x C-c ,=     | =M-x crux-find-user-custom-file=                                        | Open user's custom file.                                                                                                                                                                                                                                                                   |
| =H-x H-x C-c S=     | =M-x crux-find-shell-init-file=                                         | Open shell's init file.                                                                                                                                                                                                                                                                    |
| =H-x H-x C-j=       | =M-x crux-top-join-line=                                                | Join lines                                                                                                                                                                                                                                                                                 |
| =H-x H-x C-K=       | =M-x crux-kill-whole-line=                                              | Kill whole line                                                                                                                                                                                                                                                                            |
| =H-x H-x C-BCK=     | =M-x crux-kill-line-backwards=                                          | Kill line backwards                                                                                                                                                                                                                                                                        |
| =H-x H-x C-S-BCK=   | =M-x crux-kill-and-join-forward=                                        | If at end of line, join with following; otherwise kill line.                                                                                                                                                                                                                               |
| =H-x H-x C-c P=     | =M-x crux-kill-buffer-truename=                                         | Kill absolute path of file visited in current buffer.                                                                                                                                                                                                                                      |
| =H-x H-x C-c i=     | =M-x crux-ispell-word-then-abbrev=                                      | Fix word using ispell and then save to abbrev.                                                                                                                                                                                                                                             |
| =H-x H-x C-x C-u=   | =M-x crux-upcase-region=                                                | Upcase-region when transient-mark-mode is on and region is active.                                                                                                                                                                                                                         |
| =H-x H-x C-x C-l=   | =M-x crux-downcase-region=                                              | Downcase-region when transient-mark-mode is on and region is active.                                                                                                                                                                                                                       |
| =H-x H-x C-x M-c=   | =M-x crux-capitalize-region=                                            | Capitalize-region when transient-mark-mode is on and region is active.                                                                                                                                                                                                                     |
| =H-x H-x M-o=       | =M-x crux-other-window-or-switch-buffer=                                | Select other window, or switch to most recent buffer if only one windows.                                                                                                                                                                                                                  |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =<f5>=              | =M-x dap-debug=                                                         | Create and run new configuration using the available templates.                                                                                                                                                                                                                            |
| =S-<f5>=            | =M-x dap-disconnect=                                                    | Cancel current debug session.                                                                                                                                                                                                                                                              |
| =M-<f5>=            | =M-x dap-debug-last=                                                    | Debug previous configuration.                                                                                                                                                                                                                                                              |
| =C-M-<f5>=          | =M-x dap-debug-recent=                                                  | Select configuration to run from the previously started command.                                                                                                                                                                                                                           |
| =C-S-<f5>=          | =M-x dap-debug-restart=                                                 | Restarts current frame.                                                                                                                                                                                                                                                                    |
| =<f6>=              | =M-x dap-continue=                                                      | Debug continue.                                                                                                                                                                                                                                                                            |
| =S-<f6>=            | =M-x dap-restart-frame=                                                 | Restarts current frame.                                                                                                                                                                                                                                                                    |
| =<f7>=              | =M-x dap-hydra=                                                         | Opens a [[https://emacs-lsp.github.io/dap-mode/][dap-mode]] hydra.                                                                                                                                                                                                                                                                    |
| =<f9>=              | =M-x dap-breakpoint-toggle=                                             | Toggle breakpoint at line.                                                                                                                                                                                                                                                                 |
| =C-<f9>=            | =M-x dap-breakpoint-add=                                                | Add breakpoint at line.                                                                                                                                                                                                                                                                    |
| =S-<f9>=            | =M-x dap-breakpoint-delete=                                             | Delete breakpoint at line.                                                                                                                                                                                                                                                                 |
| =C-S-<f9>=          | =M-x dap-breakpoint-delete-all=                                         | Delete all breakpoints.                                                                                                                                                                                                                                                                    |
| =M-<f9>=            | =M-x dap-breakpoint-condition=                                          | Set/unset breakpoint condition.                                                                                                                                                                                                                                                            |
| =C-M-<f9>=          | =M-x dap-breakpoint-hit-condition=                                      | Set/unset breakpoint hit condition.                                                                                                                                                                                                                                                        |
| =S-M-<f9>=          | =M-x dap-breakpoint-log-message=                                        | Set/unset breakpoint log message.                                                                                                                                                                                                                                                          |
| =<f10>=             | =M-x dap-next=                                                          | Debug next.                                                                                                                                                                                                                                                                                |
| =C-<f10>=           | =M-x psimacs/dap/run-to-cursor=                                         | Add breakpoint at point and continue.                                                                                                                                                                                                                                                      |
| =<f11>=             | =M-x dap-step-in=                                                       | Debug step in.                                                                                                                                                                                                                                                                             |
| =S-<f11>=           | =M-x dap-step-out=                                                      | Debug step out.                                                                                                                                                                                                                                                                            |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c-l <tab>=       | =M-x company-indent-or-complete-common=                                 | Indent the current line or region, or complete the common part.                                                                                                                                                                                                                            |
| =C-c l C-c h d=     | =M-x dap-hydra=                                                         | Opens a [[https://emacs-lsp.github.io/dap-mode/][dap-mode]] hydra.                                                                                                                                                                                                                                                                    |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c l s s=         | =M-x lsp=                                                               | Entry point for the server startup.                                                                                                                                                                                                                                                        |
| =C-c l s r=         | =M-x lsp-workspace-restart=                                             | Restart workspace and language server.                                                                                                                                                                                                                                                     |
| =C-c l s q=         | =M-x lsp-workspace-shutdown=                                            | Shutdown workspace and language server.                                                                                                                                                                                                                                                    |
| =C-c l s d=         | =M-x lsp-describe-session=                                              | Describes current session.                                                                                                                                                                                                                                                                 |
| =C-c l s D=         | =M-x lsp-disconnect=                                                    | Disconnect the buffer from the language server keeping the server running.                                                                                                                                                                                                                 |
| =C-c l = ==         | =M-x lsp-format-buffer=                                                 | Ask the server to format this document.                                                                                                                                                                                                                                                    |
| =C-c l = r=         | =M-x lsp-format-region=                                                 | Ask the server to format the region, or if none is selected, the current line.                                                                                                                                                                                                             |
| =C-c l F a=         | =M-x lsp-workspace-folders-add=                                         | Add new project root to the list of workspace folders.                                                                                                                                                                                                                                     |
| =C-c l F r=         | =M-x lsp-workspace-folders-remove=                                      | Remove project root from the list of workspace folders.                                                                                                                                                                                                                                    |
| =C-c l F b=         | =M-x lsp-workspace-blacklist-remove=                                    | Remove project root from the workspace blacklist.                                                                                                                                                                                                                                          |
| =C-c l T a=         | =M-x lsp-modeline-code-actions-mode=                                    | Toggle code actions on modeline.                                                                                                                                                                                                                                                           |
| =C-c l T b=         | =M-x lsp-headerline-breadcrumb-mode=                                    | Toggle breadcrumb on headerline.                                                                                                                                                                                                                                                           |
| =C-c l T L=         | =M-x lsp-toggle-trace-io=                                               | Toggle client-server protocol logging.                                                                                                                                                                                                                                                     |
| =C-c l T h=         | =M-x lsp-toggle-symbol-highlight=                                       | Toggle symbol highlighting.                                                                                                                                                                                                                                                                |
| =C-c l T S=         | =M-x lsp-ui-sideline-mode=                                              | Toggle minor mode for showing information for current line in sideline.                                                                                                                                                                                                                    |
| =C-c l T d=         | =M-x lsp-ui-doc-mode=                                                   | Toggle minor mode for showing hover information in child frame.                                                                                                                                                                                                                            |
| =C-c l T s=         | =M-x lsp-toggle-signature-auto-activate=                                | Toggle signature auto activate.                                                                                                                                                                                                                                                            |
| =C-c l T f=         | =M-x lsp-toggle-on-type-formatiing=                                     | Toggle on type formatting.                                                                                                                                                                                                                                                                 |
| =C-c l T D=         | =M-x lsp-modeline-diagnostics-mode=                                     | Toggle diagnostics modeline.                                                                                                                                                                                                                                                               |
| =C-c l T T=         | =M-x lsp-treemacs-sync-mode=                                            | Toggle global minor mode for synchronizing lsp-mode workspace folders and treemacs projects.                                                                                                                                                                                               |
| =C-c l g g=         | =M-x lsp-find-definition=                                               | Find definitions of the symbol under point.                                                                                                                                                                                                                                                |
| =C-c l g r=         | =M-x lsp-find-references=                                               | Find references of the symbol under point.                                                                                                                                                                                                                                                 |
| =C-c l g e=         | =M-x lsp-treemacs-errors-list=                                          | Display error list.                                                                                                                                                                                                                                                                        |
| =C-c l g d=         | =M-x lsp-find-declaration=                                              | Find declarations of the symbol under point.                                                                                                                                                                                                                                               |
| =C-c l g h=         | =M-x lsp-treemacs-call-hierarchy=                                       | Show the incoming call hierarchy for the symbol at point.                                                                                                                                                                                                                                  |
| =C-c l g a=         | =M-x xref-find-apropos=                                                 | Find all meaningful symbols that match pattern.                                                                                                                                                                                                                                            |
| =C-c l G s=         | =M-x lsp-ui-peak-find-workspace-symbol=                                 | Find symbols in the workspace.                                                                                                                                                                                                                                                             |
| =C-c l h h=         | =M-x lsp-describe-thing-at-point=                                       | Display the type signature and documentation of the thing at                                                                                                                                                                                                                               |
| =C-c l h s=         | =M-x lsp-signature-activate=                                            | Activate signature help.                                                                                                                                                                                                                                                                   |
| =C-c l h g=         | =M-x lsp-ui-doc-glance=                                                 | Trigger display hover information popup and hide it on next typing.                                                                                                                                                                                                                        |
| =C-c l r r=         | =M-x lsp-rename=                                                        | Rename the symbol (and all references to it).                                                                                                                                                                                                                                              |
| =C-c l r o=         | =M-x lsp-organize-imports=                                              | Perform the source.organizeImports code action, if available.                                                                                                                                                                                                                              |
| =C-c l a a=         | =M-x lsp-execute-code-action=                                           | Execute code action.                                                                                                                                                                                                                                                                       |
| =C-c l a h=         | =M-x lsp-document-highlight=                                            | Highlight all relevant references to the symbol at point.                                                                                                                                                                                                                                  |
| =C-c l G g=         | =M-x lsp-ui-peek-find-definitions=                                      | Peek definitions to the identifier at point.                                                                                                                                                                                                                                               |
| =C-c l G r=         | =M-x lsp-ui-peek-find-references=                                       | Peek references to the identifier at point.                                                                                                                                                                                                                                                |
| =C-c l G s=         | =M-x lsp-ui-peek-workspace-symbol=                                      | Peek symbols in the workspace.                                                                                                                                                                                                                                                             |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c l C-c i=       | =M-x lsp-ui-peek-find-implementation=                                   | Find implementation locations of the symbol at point.                                                                                                                                                                                                                                      |
| =C-c l C-c m=       | =M-x lsp-ui-imenu=                                                      | Open ui-imenu in side window.                                                                                                                                                                                                                                                              |
| =C-c l C-c d=       | =M-x psimacs/lsp-ui-mode/toggle-lsp-ui-doc=                             | Minor mode for showing information in child frame.                                                                                                                                                                                                                                         |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c n A=           | =M-x psimacs/org-roam/refresh-agenda-list=                              | Let be the org-agenda files the ones that have tag <Project>.                                                                                                                                                                                                                              |
| =C-c n R=           | =M-x org-roam-node-random=                                              | Find and open a random Org-roam node.                                                                                                                                                                                                                                                      |
| =C-c n c=           | =M-x org-roam-capture=                                                  | Launches an org-capture process for a new or existing node.                                                                                                                                                                                                                              |
| =C-c n f=           | =M-x org-roam-node-find=                                                | Find and open an Org-roam node by its title or alias.                                                                                                                                                                                                                                      |
| =C-c n o=           | =M-x org-id-get-create=                                                 | Create an ID for the current entry and return it.                                                                                                                                                                                                                                          |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c n i i=         | =M-x org-roam-node-insert=                                              | Find an Org-roam node and insert (where the point is) an "id:" link to it.                                                                                                                                                                                                                 |
| =C-c n i D=         | =M-x psimacs/org-roam/node-insert-immediate-default=                    | Immediate node insertion using the default capture template.                                                                                                                                                                                                                               |
| =C-c n i I=         | =M-x psimacs/org-roam/node-insert-immediate=                            | Immediate node insertion but let you choose the capture template.                                                                                                                                                                                                                          |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c n p f=         | =M-x psimacs/org-roam/find-project=                                     | Find org roam node files which have tag <Project>.                                                                                                                                                                                                                                         |
| =C-c n p n=         | =M-x psimacs/org-roam/project-capture-note=                             | Select or create project node and capture note.                                                                                                                                                                                                                                            |
| =C-c n p r=         | =M-x psimacs/org-roam/project-capture-reference=                        | Select or create project node and capture reference.                                                                                                                                                                                                                                       |
| =C-c n p s=         | =M-x psimacs/org-roam/project-capture-resource=                         | Select or create project node and capture resource.                                                                                                                                                                                                                                        |
| =C-c n p t=         | =M-x psimacs/org-roam/project-capture-task=                             | Select or create project node and capture task.                                                                                                                                                                                                                                            |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c n x i=         | =M-x psimacs/org-roam/capture-inbox=                                    | Create a inbox capture node.                                                                                                                                                                                                                                                               |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c n r f=         | =M-x org-roam-ref-find=                                                 | Find and open an Org-roam node thats dedicated to a specific ref.                                                                                                                                                                                                                         |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c n a a=         | =M-x org-roam-alias-add=                                                | Add ALIAS to the node at point.                                                                                                                                                                                                                                                            |
| =C-c n a r=         | =M-x org-roam-ref-add=                                                  | Add REF to the node at point.                                                                                                                                                                                                                                                              |
| =C-c n a t=         | =M-x org-roam-tag-add=                                                  | Add TAGS to the node at point.                                                                                                                                                                                                                                                             |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c n g g=         | =M-x org-roam-graph=                                                    | Build and possibly display a graph for NODE.                                                                                                                                                                                                                                               |
| =C-c n g u=         | =M-x org-roam-ui-mode=                                                  | Enable org-roam-ui.                                                                                                                                                                                                                                                                        |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c n b d=         | =M-x org-roam-buffer-display-dedicated=                                 | Launch NODE dedicated Org-roam buffer.                                                                                                                                                                                                                                                     |
| =C-c n b t=         | =M-x org-roam-buffer-toggle=                                            | Toggle display of the persistent org-roam-buffer.                                                                                                                                                                                                                                        |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c n d f=         | =M-x org-roam-dailies-find-directory=                                   | Find and open org-roam-dailies-directory.                                                                                                                                                                                                                                                |
| =C-c n d c=         | =M-x org-roam-dailies-goto-date=                                        | Find the daily-note for a date using the calendar, creating it if necessary.                                                                                                                                                                                                               |
| =C-c n d C=         | =M-x org-roam-dailies-capture-date=                                     | Create an entry in the daily-note for a date using the calendar.                                                                                                                                                                                                                           |
| =C-c n d d=         | =M-x org-roam-dailies-goto-today=                                       | Find the daily-note for today, creating it if necessary.                                                                                                                                                                                                                                   |
| =C-c n d D=         | =M-x org-roam-dailies-capture-today=                                    | Create an entry in the daily-note for today.                                                                                                                                                                                                                                               |
| =C-c n d n=         | =M-x org-roam-dailies-goto-next-note=                                   | Find next daily-note.                                                                                                                                                                                                                                                                      |
| =C-c n d p=         | =M-x org-roam-dailies-goto-previous-note=                               | Find previous daily-note.                                                                                                                                                                                                                                                                  |
| =C-c n d t=         | =M-x org-roam-dailies-goto-tomorrow=                                    | Find the daily-note for tomorrow, creating it if necessary.                                                                                                                                                                                                                                |
| =C-c n d T=         | =M-x org-roam-dailies-capture-tomorrow=                                 | Create an entry in the daily-note for tomorrow.                                                                                                                                                                                                                                            |
| =C-c n d y=         | =M-x org-roam-dailies-goto-yesterday=                                   | Find the daily-note for yesterday, creating it if necessary.                                                                                                                                                                                                                               |
| =C-c n d Y=         | =M-x org-roam-dailies-capture-yesterday=                                | Create an entry in the daily-note for yesteday.                                                                                                                                                                                                                                            |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c n D=           | =M-x deft=                                                              | Switch to *Deft* buffer and load files.                                                                                                                                                                                                                                                      |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =<Ret>=             | =M-x deft-complete=                                                     | Open file.                                                                                                                                                                                                                                                                                 |
| =C-o=               | =M-x deft-open-file-other-window=                                       | Open file at point in other window.                                                                                                                                                                                                                                                        |
| =C-u C-o=           | =C-u M-x deft-open-file-other-window=                                   | Open file at point in other window and switch to window.                                                                                                                                                                                                                                   |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c C-c=           | =M-x deft-filter-clear=                                                 | Clear the current filter string and refresh the file browser.                                                                                                                                                                                                                              |
| =C-c C-q=           | =M-x quit-window=                                                       | Close Deft window.                                                                                                                                                                                                                                                                         |
| =C-c C-g=           | =M-x deft-refresh=                                                      | Update the file cache, reapply the filter, and refresh the *Deft* buffer.                                                                                                                                                                                                                    |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c C-t=           | =M-x deft-toggle-incremental-search=                                    | Toggle the deft-incremental-search setting.                                                                                                                                                                                                                                              |
| =C-c C-l=           | =M-x deft-filter=                                                       | Update the filter with STR and update the file browser.                                                                                                                                                                                                                                    |
| =C-c C-s=           | =M-x deft-toggle-sort-method=                                           | Toggle file sorting method defined in deft-current-sort-method                                                                                                                                                                                                                           |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =C-c C-n=           | =M-X deft-new-file=                                                     | Create a new file quickly.                                                                                                                                                                                                                                                                 |
| =C-c C-d=           | =M-x deft-delete-file=                                                  | Delete the file represented by the button at the point.                                                                                                                                                                                                                                    |
| =C-c C-r=           | =M-x deft-rename-file=                                                  | Rename the file represented by the button at the point.                                                                                                                                                                                                                                    |
| =C-c C-a=           | =M-x deft-archive-file=                                                 | Archive the file represented by the button at the point.                                                                                                                                                                                                                                   |
|-------------------+-----------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
